"""
1. Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности, каждую на отдельной строчке.

    Формат входных данных
    На вход программе подаются три строки, каждая на отдельной строке. Использовать input()

    Формат выходных данных
    Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке. Использовать print()
"""
...


"""
2. Напишите программу, которая считывает три строки по очереди, а затем выводит их в ОБРАТНОЙ последовательности, каждую на отдельной строчке.

    Формат входных данных
    На вход программе подаются три строки, каждая на отдельной строке. Использовать input()

    Формат выходных данных
    Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке. Использовать print()
"""
...


"""
3. Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.

    Формат входных данных
    На вход программе подаётся три целых числа, каждое на отдельной строке. Использовать input()

    Формат выходных данных
    Программа должна вывести сумму введенных чисел. Использовать print()
"""
...


"""
4. Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

    Формат входных данных
    На вход программе подается одно целое число – длина ребра. Использовать input()

    Формат выходных данных
    Программа должна вывести текст и числа в соответствии с условием задачи. Использовать print()

    Примечание. Объём куба и площадь полной поверхности можно вычислить по формулам
"""
...


"""
5. Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора, системного блока, клавиатуры и мыши.

Формат входных данных
На вход программе подаётся четыре целых числа, каждое на отдельной строке.
В первой строке — стоимость монитора, во второй строке — стоимость системного блока, в третьей строке — стоимость клавиатуры и в четвертой строке — стоимость мыши. Использовать input()

Формат выходных данных
Программа должна вывести одно число – стоимость покупки (трех компьютеров). Использовать print()
"""
...


"""
6. Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, введенных с клавиатуры.

Формат входных данных
На вход программе подаётся два целых числа, каждое на отдельной строке. Использовать input()
Пример ввода: 2
              7

Формат выходных данных
Программа должна вывести сумму, разность и произведение введённых чисел, каждое на отдельной строке. Использовать print()
Пример вывода: 2 + 7 = 9
               2 - 7 = -5
               2 * 7 = 14
"""
...


"""
7. Напишите программу, которая находит полное число метров по заданному числу сантиметров.

Формат входных данных
На вход программе подаётся натуральное число – количество сантиметров. Использовать input()

Формат выходных данных
Программа должна вывести одно число – полное число метров. Использовать print()
"""
...


"""
8. Напишите программу, которая определяет, разрешен пользователю доступ к интернет-ресурсу или нет.

Формат входных данных
На вход программе подаётся целое число — возраст пользователя. Использовать input()

Формат выходных данных
Программа должна вывести текст «Доступ разрешен» если возраст не менее 18, и «Доступ запрещен» в противном случае. Использовать print()
"""
...


"""
9. Напишите программу, которая определяет, является ли год с данным номером високосным. Если год является високосным, то выведите «YES», иначе выведите «NO».
    Год является високосным, если его номер кратен 4, но не кратен 100, или если он кратен 400.

Формат входных данных
На вход программе подаётся натуральное число. Использовать input()

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. Использовать print()
"""
...


"""
10. Напишите программу, которая считывает целое число и выводит соответствующую ему римскую цифру.
Если число находится вне диапазона 1-10, то программа должна вывести текст «ошибка».

В таблице приведены римские цифры для чисел от 1 до 10.
Число	Римская цифра
1	I
2	II
3	III
4	IV
5	V
6	VI
7	VII
8	VIII
9	IX
10	X

Формат входных данных
На вход программе подаётся целое число. Использовать input()

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. Использовать print()
"""
...
