"""
1. Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).
"""
...


"""
2. На вход программе подается строка текста – имя человека.
   Напишите программу, которая выводит на экран приветствие в виде слова «Привет» (без кавычек), после которого должна стоять запятая и пробел, а затем введенное имя.

   Примечание 1. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().
"""
...


"""
3.На вход программе подается строка текста – название футбольной команды.
 Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).
"""
...


"""
4. Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.

    Формат входных данных
    На вход программе подается одно целое число.
    
    Формат выходных данных
    Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.
"""
...


"""
5. Напишите программу, которая считывает целое число, после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.

Формат входных данных
На вход программе подаётся целое число.

Формат выходных данных
Программа должна вывести текст согласно условию задачи.
"""
...


"""
6. Напишите программу, которая сравнивает пароль и его подтверждение.
Если они совпадают, то программа выводит: «Пароль принят», иначе: «Пароль не принят».
Принимать пароль через input()

Формат входных данных
На вход программе подаются две строки.

Формат выходных данных
Программа должна вывести одну строку в соответствии с условием задачи.
"""
...

"""
7. Напишите программу, которая определяет, является число четным или нечетным

Формат входных данных
На вход программе подаётся одно целое число.

Формат выходных данных
Программа должна вывести «Четное», если число четное, и «Нечетное» — если число нечетное.
"""
...

"""
8. Напишите программу, которая определяет, является число четным или нечетным

Формат входных данных
На вход программе подаётся одно целое число.

Формат выходных данных
Программа должна вывести «Четное», если число четное, и «Нечетное» — если число нечетное.
"""
...
