"""
1. Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).
"""


"""
2. На вход программе подается строка текста – имя человека.
   Напишите программу, которая выводит на экран приветствие в виде слова «Привет» (без кавычек), после которого должна стоять запятая и пробел, а затем введенное имя.

   Примечание 1. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().
"""


"""
3.На вход программе подается строка текста – название футбольной команды.
 Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).
"""


"""
4. Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.

    Формат входных данных
    На вход программе подается одно целое число.
    
    Формат выходных данных
    Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.
"""


"""
5. Напишите программу, которая считывает целое число, после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.

Формат входных данных
На вход программе подаётся целое число. Пример: 5

Формат выходных данных
Программа должна вывести текст согласно условию задачи.
Пример:
Следующее за числом 5 число 6
Предыдущее числу 5 число 4
"""

